+++
```C#
int getDaysToNY(DateTime date)
{
    return (int)Math.Abs((date.Date - new DateTime(date.Year + 1, 1, 1)).TotalDays);
}
Console.WriteLine(getDaysToNY(new(2025, 11, 11)));
```

### Формулировка
Напишите программу для калькуляции количества дней до нового года.

### Пояснение
Программа должна использовать текущую дату для определения количества дней до наступления нового года.

### Тесты

1. **Пример 1:**
   - Вход: текущая дата = 13 октября 2024 года
   - Ожидаемый вывод: "До нового года осталось 79 дней."

2. **Пример 2:**
   - Вход: текущая дата = 1 января 2024 года
   - Ожидаемый вывод: "Сегодня уже новый год!"

3. **Пример 3:**
   - Вход: текущая дата = 15 декабря 2023 года
   - Ожидаемый вывод: "До нового года осталось 16 дней."

