-- Добавление записей
-- Вставка данных в таблицу employees
INSERT INTO employees (id, name, position, salary, email) VALUES
(7, 'Мария Петрова', 'Разработчик', 60000.00, 'petrova@example.com'),
(8, 'Алексей Смирнов', 'Аналитик', 55000.00, 'smirnov@example.com'),
(9, 'Инна Сидорова', 'Тестировщик', 45000.00, 'sidorova@example.com'),
(10, 'Дмитрий Козлов', 'Дизайнер', 52000.00, 'kozlov@example.com'),
(11, 'Елена Новикова', 'Менеджер проектов', 58000.00, 'novikova@example.com'),
(12, 'Сергей Морозов', 'Системный администратор', 53000.00, 'morozov@example.com'),
(13, 'Анна Волкова', 'HR-специалист', 48000.00, 'volkova@example.com'),
(14, 'Павел Соколов', 'Маркетолог', 51000.00, 'sokolov@example.com'),
(15, 'Татьяна Лебедева', 'Бухгалтер', 49000.00, 'lebedeva@example.com'),
(16, 'Иван Иванов', 'Менеджер', 50000.00, 'ivanov@example.com');

INSERT INTO employees (id, name, position, salary, email) VALUES
(17, 'Мария Петрова', 'Разработчик', 60000.00, 'petrova_1@example.com'),
(18, 'Мария Петрова', 'Разработчик', 60000.00, 'petrova_2@example.com'),
(19, 'Мария Петрова', 'Разработчик', 60000.00, 'petrova_3@example.com');


-- Вставка данных в таблицу employee_details
INSERT INTO employee_details (id, employee_id, address, phone, age) VALUES
(7, 7, 'ул. Пушкина, д. 20', '+7-900-234-56-78', 28),
(8, 8, 'ул. Гагарина, д. 30', '+7-900-345-67-89', 28),
(9, 9, 'ул. Чехова, д. 40', '+7-900-456-78-90', 29),
(10, 10, 'ул. Толстого, д. 50', '+7-900-567-89-01', 29),
(11, 11, 'ул. Достоевского, д. 60', '+7-900-678-90-12', 29),
(12, 12, 'ул. Тургенева, д. 70', '+7-900-789-01-23', 30),
(13, 13, 'ул. Гоголя, д. 80', '+7-900-890-12-34', 28),
(14, 14, 'ул. Лермонтова, д. 90', '+7-900-901-23-45', 31),
(15, 15, 'ул. Есенина, д. 100', '+7-900-012-34-56', 29),
(16, 16, 'ул. Ленина, д. 10', '+7-900-123-45-67', 30);

